app/controllers/carts_controller.rb

INSERT INTO "carts" ("name", "expiry", "minimum_payment", "status_id", "key", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "cart_roles" ("user_id", "cart_id", "role_id") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["cart_id", 1], ["role_id", 1]]
---
  def create
    @cart = Cart.new(cart_params)
    ## stores the minimum payment in cents so users can input a regular
    ## dollar amount
    @cart.minimum_payment = convert_to_cents(cart_params[:minimum_payment])
    @cart.status_id = 1
    @cart.key = SecureRandom.uuid
    if @cart.save
      current_user.save
      current_user.cart_roles.create(user_id: current_user.id, cart_id: @cart.id, role_id: 1)

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "cart_roles".* FROM "cart_roles" WHERE "cart_roles"."cart_id" = $1  [["cart_id", 1]]
SELECT "payments".* FROM "payments" WHERE "payments"."cart_id" = $1  [["cart_id", 1]]
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."cart_id" = $1  [["cart_id", 1]]
SELECT "users".* FROM "users" INNER JOIN cart_roles ON cart_roles.user_id = users.id INNER JOIN carts ON carts.id = cart_roles.cart_id
---
  def show
    @contributors = []
    @cart = Cart.find(params[:id])
    session[:cart_id] = @cart.id
    # @users = @cart.users

    @cart_payments = get_cart_payments(@cart.id)
    ## cart_payments returns an array of all payments made - including
    ## username, id, amount, date
    @total_payments = calculate_total_payments(@cart_payments)

    @display_minimum_payment = ((@cart.minimum_payment / 100).to_f)

    # Sorts through those users to find which users belong to your current cart
    @contributors = CartRole.where(cart_id: @cart.id).uniq
    # Query all the products in the cart from Amazon
    @products = @cart.products
    @goal = @cart.total

    @contributors = @cart.users
    # CartRole.where(cart_id: @cart.id).uniq
    # Query all the products in the cart
    @products = @cart.products

    @cart_payments = get_cart_payments(@cart.id)
    @cart_refunds = Refund.where(cart_id: @cart.id).sum(:amount)
    @progress = cart_progress(@total_payments, @goal)

    @cart.cart_roles.each do |c|