app/controllers/charges_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "payments" ("user_id", "cart_id", "stripe_customer_id", "stripe_charge_id", "amount", "captured", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # Amount in cents
    @amount = params[:amount]
    @cart_id = params[:cart]
    token = params[:stripeToken]

    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => 'Rails Stripe customer',
      :currency    => 'usd'
    )

    @payment = Payment.new(
      user_id: current_user.id,
      cart_id: @cart_id,
      stripe_customer_id: charge.customer,
      stripe_charge_id: charge.id,
      amount: charge.amount
    )

    @payee = User.where(id: @payment.user_id)

    @payment.save

SELECT  "payments".* FROM "payments" WHERE "payments"."stripe_charge_id" = $1 LIMIT 1  [["stripe_charge_id", "ch_18LkUEFivzcmVo6mD1Z1An8W"]]
INSERT INTO "payments" ("user_id", "cart_id", "stripe_customer_id", "stripe_charge_id", "amount", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def refund
    refund = Stripe::Refund.create(
      charge: params[:stripe_charge_id]
    )
    matching_payment = Payment.find_by(stripe_charge_id: params[:stripe_charge_id])
    payment = Payment.new(
      user_id: matching_payment.user_id,
      cart_id: matching_payment.cart_id,
      stripe_customer_id: matching_payment.stripe_customer_id,
      stripe_charge_id: refund.charge,
      amount: refund.amount,
      status: "refunded"
    )
    payment.save